doc/examples/fluidsimfoam-cavity/tests/saved_cases/cavity/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions       [0 1 -1 0 0 0 0];

internalField    uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type     fixedValue;
        value    uniform (1 0 0);
    }
    fixedWalls
    {
        type    noSlip;
    }
    frontAndBack
    {
        type    empty;
    }
}
