doc/examples/fluidsimfoam-cavity/tests/saved_cases/cavity/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions       [0 2 -2 0 0 0 0];

internalField    uniform 0;

boundaryField
{
    movingWall
    {
        type    zeroGradient;
    }
    fixedWalls
    {
        type    zeroGradient;
    }
    frontAndBack
    {
        type    empty;
    }
}
