doc/examples/fluidsimfoam-cavity/tests/saved_cases/cavity/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

nu    0.01;
