doc/examples/fluidsimfoam-cavity/tests/saved_cases/cavity/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    (  0  0  0 )  // 0 v0-bot
    (  1  0  0 )  // 1 v1-bot
    (  1  1  0 )  // 2 v2-bot
    (  0  1  0 )  // 3 v3-bot
    (  0  0  0.1 )  // 4 v0-top
    (  1  0  0.1 )  // 5 v1-top
    (  1  1  0.1 )  // 6 v2-top
    (  0  1  0.1 )  // 7 v3-top
);

blocks
(
    hex (0 1 2 3 4 5 6 7)  (20 20 1) simpleGrading (1 1 1)  //  (v0-bot v1-bot v2-bot v3-bot v0-top v1-top v2-top v3-top)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (2 3 7 6)  // f-n (v2-bot v3-bot v3-top v2-top)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)  // f-w (v0-bot v0-top v3-top v3-bot)
            (1 2 6 5)  // f-e (v1-bot v2-bot v2-top v1-top)
            (0 1 5 4)  // f-s (v0-bot v1-bot v1-top v0-top)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)  // f-b (v0-bot v3-bot v2-bot v1-bot)
            (4 5 6 7)  // f-t (v0-top v1-top v2-top v3-top)
        );
    }
);

// ************************************************************************* //
