doc/examples/fluidsimfoam-cavity/tests/saved_cases/cavity/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default    Euler;
}

gradSchemes
{
    default    Gauss linear;
    grad(p)    Gauss linear;
}

divSchemes
{
    default       none;
    div(phi,U)    Gauss linear;
}

laplacianSchemes
{
    default    Gauss linear orthogonal;
}

interpolationSchemes
{
    default    linear;
}

snGradSchemes
{
    default    orthogonal;
}
